IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_dcsm_z2_regs.xml
<module id="DCSM_Z2_REGS" HW_revision="" description="DCSM Z2 Registers">
	<register id="Z2_LINKPOINTER" width="32" page="1" offset="0x0" internal="0" description="Zone 2 Link Pointer">
		<bitfield id="LINKPOINTER" description="Zone2 LINK Pointer" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z2_OTPSECLOCK" width="32" page="1" offset="0x2" internal="0" description="Zone 2 OTP Secure Lock">
		<bitfield id="JTAGLOCK" description="JTAG Lock Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PSWDLOCK" description="Zone2 Password Lock." begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="CRCLOCK" description="Zone2 CRC Lock." begin="11" end="8" width="4" rwaccess="R"/>
	</register>
	<register id="Z2_LINKPOINTERERR" width="32" page="1" offset="0x6" internal="0" description="Link Pointer Error">
		<bitfield id="Z2_LINKPOINTERERR" description="Error to Resolve Z2 Link pointer from OTP loaded values" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG1" width="32" page="1" offset="0x8" internal="0" description="Zone 2 General Purpose Register-1">
		<bitfield id="GPREG1" description="General Purpose Register-1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG2" width="32" page="1" offset="0xa" internal="0" description="Zone 2 General Purpose Register-2">
		<bitfield id="GPREG2" description="General Purpose Register-2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG3" width="32" page="1" offset="0xc" internal="0" description="Zone 2 General Purpose Register-3">
		<bitfield id="GPREG3" description="General Purpose Register-3" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_GPREG4" width="32" page="1" offset="0xe" internal="0" description="Zone 2 General Purpose Register-4">
		<bitfield id="GPREG4" description="General Purpose Register-4" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z2_CSMKEY0" width="32" page="1" offset="0x10" internal="0" description="Zone 2 CSM Key 0">
		<bitfield id="Z2_CSMKEY0" description="Word0 to unlock Zone2, should match  Z2_CSMPSWD0." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CSMKEY1" width="32" page="1" offset="0x12" internal="0" description="Zone 2 CSM Key 1">
		<bitfield id="Z2_CSMKEY1" description="Word1 to unlock Zone2, should match Z2_CSMPSWD1" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CSMKEY2" width="32" page="1" offset="0x14" internal="0" description="Zone 2 CSM Key 2">
		<bitfield id="Z2_CSMKEY2" description="Word2 to unlock Zone2, should match Z2_CSMPSWD2" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CSMKEY3" width="32" page="1" offset="0x16" internal="0" description="Zone 2 CSM Key 3">
		<bitfield id="Z2_CSMKEY3" description="Word3 to unlock Zone2, should match Z2_CSMPSWD3" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z2_CR" width="32" page="1" offset="0x18" internal="0" description="Zone 2 CSM Control Register">
		<bitfield id="ALLZERO" description="CSMPSWD All Zeros" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ALLONE" description="CSMPSWD All Ones" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="UNSECURE" description="CSMPSWD Match CSMKEY" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ARMED" description="CSM Passwords Read Status" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="FORCESEC" description="Force Secure" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="Z2_GRABSECT1R" width="32" page="1" offset="0x1a" internal="0" description="Zone 2 Grab Flash Status Register 1">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in CPU1 BANK" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in CPU1 BANK" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in CPU1 BANK" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in CPU1 BANK" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in CPU1 BANK" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in CPU1 BANK" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in CPU1 BANK" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in CPU1 BANK" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in CPU1 BANK" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in CPU1 BANK" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in CPU1 BANK" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in CPU1 BANK" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in CPU1 BANK" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in CPU1 BANK" begin="27" end="26" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABSECT2R" width="32" page="1" offset="0x1c" internal="0" description="Zone 2 Grab Flash Status Register 2">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in CM BANK" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in CM BANK" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in CM BANK" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in CM BANK" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in CM BANK" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in CM BANK" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in CM BANK" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in CM BANK" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in CM BANK" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in CM BANK" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in CM BANK" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in CM BANK" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in CM BANK" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in CM BANK" begin="27" end="26" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABSECT3R" width="32" page="1" offset="0x1e" internal="0" description="Zone 2 Grab Flash Status Register 3">
		<bitfield id="GRAB_SECT0" description="Grab Flash Sector 0 in CPU2 BANK" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT1" description="Grab Flash Sector 1 in CPU2 BANK" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT2" description="Grab Flash Sector 2 in CPU2 BANK" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT3" description="Grab Flash Sector 3 in CPU2 BANK" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT4" description="Grab Flash Sector 4 in CPU2 BANK" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT5" description="Grab Flash Sector 5 in CPU2 BANK" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT6" description="Grab Flash Sector 6 in CPU2 BANK" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT7" description="Grab Flash Sector 7 in CPU2 BANK" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT8" description="Grab Flash Sector 8 in CPU2 BANK" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT9" description="Grab Flash Sector 9 in CPU2 BANK" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT10" description="Grab Flash Sector 10 in CPU2 BANK" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT11" description="Grab Flash Sector 11 in CPU2 BANK" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT12" description="Grab Flash Sector 12 in CPU2 BANK" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_SECT13" description="Grab Flash Sector 13 in CPU2 BANK" begin="27" end="26" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABRAM1R" width="32" page="1" offset="0x20" internal="0" description="Zone 2 Grab RAM Status Register 1">
		<bitfield id="GRAB_RAM0" description="Grab RAM CPU1.LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM CPU1.LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM CPU1.LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM CPU1.LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM CPU1.LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM CPU1.LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM CPU1.LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM CPU1.LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM8" description="Grab RAM CPU1.D0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM9" description="Grab RAM CPU1.D1" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABRAM2R" width="32" page="1" offset="0x22" internal="0" description="Zone 2 Grab RAM Status Register 2">
		<bitfield id="GRAB_RAM0" description="Grab RAM CM.C0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM CM.C1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM CPU1TOCM MSGRAM0_L" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM CPU1TOCM MSGRAM0_H" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM CMTOCPU1 MSGRAM0_L" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM CMTOCPU1 MSGRAM0_H" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM8" description="Grab RAM CPU2TOCM MSGRAM0_L" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM9" description="Grab RAM CPU2TOCM MSGRAM0_H" begin="19" end="18" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM10" description="Grab RAM CMTOCPU2 MSGRAM0_L" begin="21" end="20" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM11" description="Grab RAM CMTOCPU2 MSGRAM0_H" begin="23" end="22" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM12" description="Grab RAM CPU1TOCPU2 MSGRAM0_L" begin="25" end="24" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM13" description="Grab RAM CPU1TOCPU2 MSGRAM0_H" begin="27" end="26" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM14" description="Grab RAM CPU2TOCPU1 MSGRAM0_L" begin="29" end="28" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM15" description="Grab RAM CPU2TOCPU1 MSGRAM0_H" begin="31" end="30" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_GRABRAM3R" width="32" page="1" offset="0x24" internal="0" description="Zone 2 Grab RAM Status Register 3">
		<bitfield id="GRAB_RAM0" description="Grab RAM CPU2.LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM CPU2.LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM CPU2.LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM CPU2.LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM CPU2.LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM CPU2.LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM CPU2.LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM CPU2.LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM8" description="Grab RAM CPU2.D0" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM9" description="Grab RAM CPU2.D1" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="Z2_EXEONLYSECT1R" width="32" page="1" offset="0x26" internal="0" description="Zone 2 Execute Only Flash Status Register 1">
		<bitfield id="EXEONLY_CPU1_SECT0" description="Execute-Only Flash Sector 0 in flash CPU1 BANK" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT1" description="Execute-Only Flash Sector 1 in flash CPU1 BANK" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT2" description="Execute-Only Flash Sector 2 in flash CPU1 BANK" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT3" description="Execute-Only Flash Sector 3 in flash CPU1 BANK" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT4" description="Execute-Only Flash Sector 4 in flash CPU1 BANK" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT5" description="Execute-Only Flash Sector 5 in flash CPU1 BANK" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT6" description="Execute-Only Flash Sector 6 in flash CPU1 BANK" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT7" description="Execute-Only Flash Sector 7 in flash CPU1 BANK" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT8" description="Execute-Only Flash Sector 8 in flash CPU1 BANK" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT9" description="Execute-Only Flash Sector 9 in flash CPU1 BANK" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT10" description="Execute-Only Flash Sector 10 in flash CPU1 BANK" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT11" description="Execute-Only Flash Sector 11 in flash CPU1 BANK" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT12" description="Execute-Only Flash Sector 12 in flash CPU1 BANK" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU1_SECT13" description="Execute-Only Flash Sector 13 in flash CPU1 BANK" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT0" description="Execute-Only Flash Sector 0 in flash CM BANK" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT1" description="Execute-Only Flash Sector 1 in flash CM BANK" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT2" description="Execute-Only Flash Sector 2 in flash CM BANK" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT3" description="Execute-Only Flash Sector 3 in flash CM BANK" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT4" description="Execute-Only Flash Sector 4 in flash CM BANK" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT5" description="Execute-Only Flash Sector 5 in flash CM BANK" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT6" description="Execute-Only Flash Sector 6 in flash CM BANK" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT7" description="Execute-Only Flash Sector 7 in flash CM BANK" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT8" description="Execute-Only Flash Sector 8 in flash CM BANK" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT9" description="Execute-Only Flash Sector 9 in flash CM BANK" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT10" description="Execute-Only Flash Sector 10 in flash CM BANK" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT11" description="Execute-Only Flash Sector 11 in flash CM BANK" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT12" description="Execute-Only Flash Sector 12 in flash CM BANK" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CM_SECT13" description="Execute-Only Flash Sector 13 in flash CM BANK" begin="29" end="29" width="1" rwaccess="R"/>
	</register>
	<register id="Z2_EXEONLYSECT2R" width="32" page="1" offset="0x28" internal="0" description="Zone 2 Execute Only Flash Status Register 2">
		<bitfield id="EXEONLY_CPU2_SECT0" description="Execute-Only Flash Sector 0 in flash CPU2 BANK" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT1" description="Execute-Only Flash Sector 1 in flash CPU2 BANK" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT2" description="Execute-Only Flash Sector 2 in flash CPU2 BANK" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT3" description="Execute-Only Flash Sector 3 in flash CPU2 BANK" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT4" description="Execute-Only Flash Sector 4 in flash CPU2 BANK" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT5" description="Execute-Only Flash Sector 5 in flash CPU2 BANK" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT6" description="Execute-Only Flash Sector 6 in flash CPU2 BANK" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT7" description="Execute-Only Flash Sector 7 in flash CPU2 BANK" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT8" description="Execute-Only Flash Sector 8 in flash CPU2 BANK" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT9" description="Execute-Only Flash Sector 9 in flash CPU2 BANK" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT10" description="Execute-Only Flash Sector 10 in flash CPU2 BANK" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT11" description="Execute-Only Flash Sector 11 in flash CPU2 BANK" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT12" description="Execute-Only Flash Sector 12 in flash CPU2 BANK" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_CPU2_SECT13" description="Execute-Only Flash Sector 13 in flash CPU2 BANK" begin="13" end="13" width="1" rwaccess="R"/>
	</register>
	<register id="Z2_EXEONLYRAM1R" width="32" page="1" offset="0x2a" internal="0" description="Zone 2 Execute Only RAM Status Register 1">
		<bitfield id="EXEONLY_RAM0" description="Execute-Only RAM CPU1.LS0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM1" description="Execute-Only RAM CPU1.LS1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM2" description="Execute-Only RAM CPU1.LS2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM3" description="Execute-Only RAM CPU1.LS3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM4" description="Execute-Only RAM CPU1.LS4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM5" description="Execute-Only RAM CPU1.LS5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM6" description="Execute-Only RAM CPU1.LS6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM7" description="Execute-Only RAM CPU1.LS7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM8" description="Execute-Only RAM CPU1.D0" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM9" description="Execute-Only RAM CPU1.D1" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM16" description="Execute-Only RAM on CM.C0" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM17" description="Execute-Only RAM on CM.C1" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM22" description="Execute-Only RAM CPU2.D1" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM23" description="Execute-Only RAM CPU2.D0" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM24" description="Execute-Only RAM CPU2.LS7" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM25" description="Execute-Only RAM CPU2.LS6" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM26" description="Execute-Only RAM CPU2.LS5" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM27" description="Execute-Only RAM CPU2.LS4" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM28" description="Execute-Only RAM CPU2.LS3" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM29" description="Execute-Only RAM CPU2.LS2" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM30" description="Execute-Only RAM CPU2.LS1" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM31" description="Execute-Only RAM CPU2.LS0" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
</module>
